content/posts/Self-organization_in_nonequilibrium_systems_from_dissipative_structures_to_order_through_fluctuations_by_Nicolis_and_Prigogine_in_1977.md
+++
title = "Self-organization in nonequilibrium systems from dissipative structures to order through fluctuations by Nicolis and Prigogine in 1977"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:50-04:00
slug = "Self-organization_in_nonequilibrium_systems_from_dissipative_structures_to_order_through_fluctuations_by_Nicolis_and_Prigogine_in_1977"
draft = false
+++

## Part I. The thermodynamic background {#part-i-dot-the-thermodynamic-background}


### 1. Introduction {#1-dot-introduction}

<!--list-separator-->

-  1.1 General comments

<!--list-separator-->

-  1.2 Open systems


### 2. Conservation equations' {#2-dot-conservation-equations}

<!--list-separator-->

-  2.1 Open systems at mechanical equilibrium

<!--list-separator-->

-  2.2 The mass-balance equations


### 3. Thermodynamics of irreversible processes: the linear region {#3-dot-thermodynamics-of-irreversible-processes-the-linear-region}

<!--list-separator-->

-  3.1 Gibbs's formula: entropy production

<!--list-separator-->

-  3.2 Phenomenological relations: The linear range of irreversible processes

<!--list-separator-->

-  3.3 Symmetry properties of the phenomenological coefficients

<!--list-separator-->

-  3.4 Stationary nonequilibrium states

<!--list-separator-->

-  3.5 Theorem of minimum entropy production

<!--list-separator-->

-  3.6 Impossibility of ordered behavior in the linear range of irreversible processes

<!--list-separator-->

-  3.7 Diffusion


### 4. Nonlinear thermodynamics {#4-dot-nonlinear-thermodynamics}

<!--list-separator-->

-  4.1 Introduction

<!--list-separator-->

-  4.2 The general evolution criterion

<!--list-separator-->

-  4.3 Evolution criterion and kinetic potential

<!--list-separator-->

-  4.4 Stability of nonequilibrium states. Dissipative structures.


## Part II. Mathematical aspects of self-organization: deterministic methods {#part-ii-dot-mathematical-aspects-of-self-organization-deterministic-methods}


### 5. Systems involving chemical reactions and diffusion-stability {#5-dot-systems-involving-chemical-reactions-and-diffusion-stability}

<!--list-separator-->

-  5.1 General formulation

<!--list-separator-->

-  5.2 Lyapunov stability

<!--list-separator-->

-  5.3 Orbital stability

<!--list-separator-->

-  5.4 [structural stability]({{< relref "structural_stability" >}})


### 6. Mathematical tools {#6-dot-mathematical-tools}

<!--list-separator-->

-  6.1 Introduction

<!--list-separator-->

-  6.2 Theory of bifurcations

<!--list-separator-->

-  6.3 Stability theory

<!--list-separator-->

-  6.4 Theory of catastrophes

<!--list-separator-->

-  6.5 Homogeneous systems involving two variables

<!--list-separator-->

-  6.6 Branchings, bifurcations, and limit cycles


### 7. Simple autocatalytic models {#7-dot-simple-autocatalytic-models}

<!--list-separator-->

-  7.1 Two intermediates

<!--list-separator-->

-  7.2 The trimolecular model (the "Brusselator")

<!--list-separator-->

-  7.3 Scaling, steady states, and boundary conditions

<!--list-separator-->

-  7.4 Linear stability analysis

<!--list-separator-->

-  7.5 Bifurcation of steady-state dissipative structures: general scheme

<!--list-separator-->

-  7.6 Bifurcation: fixed boundary conditions

<!--list-separator-->

-  7.7 Bifurcation: no-flux boundary conditions

<!--list-separator-->

-  7.8 Qualitative properties of dissipative structures in vicinity of first bifurcation

<!--list-separator-->

-  7.9 Successive instabilities and secondary bifurcations

<!--list-separator-->

-  7.10 Comparison with computer simulations

<!--list-separator-->

-  7.11 Localized steady-state dissipative structures

<!--list-separator-->

-  7.12 Bifurcation of time-periodic dissipative structures

<!--list-separator-->

-  7.13 Qualitative properties of time-periodic dissipative structures

<!--list-separator-->

-  7.14 Traveling waves in periodic geometries

<!--list-separator-->

-  7.15 The Brusselator as a closed system

<!--list-separator-->

-  7.16 Concluding remarks


### 8. Some further aspects of dissipative structures and self-organization phenomena {#8-dot-some-further-aspects-of-dissipative-structures-and-self-organization-phenomena}

<!--list-separator-->

-  8.1 Introduction

<!--list-separator-->

-  8.2 Conservative oscillations

<!--list-separator-->

-  8.3 Simple models giving rise to limit cycles

<!--list-separator-->

-  8.4 Multiple steady states and all-or-none transitions

<!--list-separator-->

-  8.5 Two-dimensional problems

<!--list-separator-->

-  8.6 Systems involving more than two chemical variables

<!--list-separator-->

-  8.7 Coupled oscillators

<!--list-separator-->

-  8.8 Heterogeneous catalysis and localized transitions

<!--list-separator-->

-  8.9 Systems involving photochemical steps

<!--list-separator-->

-  8.10 Some further methods of analysis of reaction-diffusion equations

<!--list-separator-->

-  8.11 Thermodynamic aspects of dissipative structures


## Part III. Stochastic methods {#part-iii-dot-stochastic-methods}


### 9. General comments {#9-dot-general-comments}

<!--list-separator-->

-  9.1 Introduction

<!--list-separator-->

-  9.2 Stochastic formulation

<!--list-separator-->

-  9.3 Markovian processes

<!--list-separator-->

-  9.4 Equilibrium limit

<!--list-separator-->

-  9.5 Fluctuations in nonequilibrium systems: an historical survey


### 10. Birth-and-death description of fluctuations {#10-dot-birth-and-death-description-of-fluctuations}

<!--list-separator-->

-  10.1 Master equation for birth-and-death processes

<!--list-separator-->

-  10.2 Limitations of birth-and-death formalism

<!--list-separator-->

-  10.3 Some methods of analysis of birth-and-death master equations

<!--list-separator-->

-  10.4 Moment equations

<!--list-separator-->

-  10.5 Simple examples

<!--list-separator-->

-  10.6 Systems involving two stochastic variables: The Lotka-Volterra model

<!--list-separator-->

-  10.7 Concluding remarks


### 11. Effect of diffusion: phase-space description and multivariate master equation {#11-dot-effect-of-diffusion-phase-space-description-and-multivariate-master-equation}

<!--list-separator-->

-  11.1 Necessity for a local description of fluctuations

<!--list-separator-->

-  11.2 Phase-space description of fluctuations

<!--list-separator-->

-  11.3 A simple model

<!--list-separator-->

-  11.4 Approximate solution of master equation

<!--list-separator-->

-  11.5 Molecular dynamics studies of fluctuations

<!--list-separator-->

-  11.6 Discussion

<!--list-separator-->

-  11.7 Reduction to a multivariate master equation in concentration space

<!--list-separator-->

-  11.8 The multivariate master equation in a model system

<!--list-separator-->

-  11.9 Spatial correlation in the trimolecular model

<!--list-separator-->

-  11.10 Critical behavior

<!--list-separator-->

-  11.11 Concluding remarks


### 12. A "mean-field" description of fluctuations: nonlinear master equation {#12-dot-a-mean-field-description-of-fluctuations-nonlinear-master-equation}

<!--list-separator-->

-  12.1 Introduction

<!--list-separator-->

-  12.2 Derivation of nonlinear master equation

<!--list-separator-->

-  12.3 Further properties and moment equations

<!--list-separator-->

-  12.4 Onset of a limit cycle

<!--list-separator-->

-  12.5 Onset of a spatial dissipative structure

<!--list-separator-->

-  12.6 Multiple steady-state transitions and metastability

<!--list-separator-->

-  12.7 Asymptotic solutions of nonlinear master equation

<!--list-separator-->

-  12.8 Concluding remarks


## Part IV. Control mechanisms in chemical and biological systems {#part-iv-dot-control-mechanisms-in-chemical-and-biological-systems}


### 13. Self-organization in chemical reactions {#13-dot-self-organization-in-chemical-reactions}

<!--list-separator-->

-  13.1 Introduction

<!--list-separator-->

-  13.2 Belousov-Zhabotinski reaction: experimental facts

<!--list-separator-->

-  13.3 Mechanism

<!--list-separator-->

-  13.4 The "oregonator"

<!--list-separator-->

-  13.5 Oscillatory behavior

<!--list-separator-->

-  13.6 Spatial patterns

<!--list-separator-->

-  13.7 Briggs-Rauscher reaction


### 14. Regulatory processes at the subcellular level {#14-dot-regulatory-processes-at-the-subcellular-level}

<!--list-separator-->

-  14.1 Metabolic oscillations

<!--list-separator-->

-  14.2 The glycolytic cycle

<!--list-separator-->

-  14.3 Allosteric model for glycolytic oscillations

<!--list-separator-->

-  14.4 Limit-cycle oscillations

<!--list-separator-->

-  14.5 Effect of external disturbances on limit-cycle oscillation

<!--list-separator-->

-  14.6 Patterns of spatiotemporal organization in allosteric enzyme model

<!--list-separator-->

-  14.7 Periodic synthesis of cAMP

<!--list-separator-->

-  14.8 Reactions involving membrane-bound enzymes

<!--list-separator-->

-  14.9 Physiological significance of metabolic oscillations


### 15. Regulatory processes at cellular level {#15-dot-regulatory-processes-at-cellular-level}

<!--list-separator-->

-  15.1 Introduction

<!--list-separator-->

-  15.2 Lac operon

<!--list-separator-->

-  15.3 Mathematical model for induction of beta-galactosidase

<!--list-separator-->

-  15.4 All-or-none transitions

<!--list-separator-->

-  15.5 Catabolite repression: sustained oscillations and threshold phenomena

<!--list-separator-->

-  15.6 Control of cellular division

<!--list-separator-->

-  15.7 Quantitative model


### 16. Cellular differentiation and pattern formation {#16-dot-cellular-differentiation-and-pattern-formation}

<!--list-separator-->

-  16.1 Introductory remarks

<!--list-separator-->

-  16.2 Positional information

<!--list-separator-->

-  16.3 Mechanisms involved in positional information

<!--list-separator-->

-  16.4 Dissipative structures and onset of polarity

<!--list-separator-->

-  16.5 A quantitative model

<!--list-separator-->

-  16.6 Positional differentiation

<!--list-separator-->

-  16.7 Applications


## Part V. Evolution and population dynamics {#part-v-dot-evolution-and-population-dynamics}


### 17. Thermodynamics of evolution {#17-dot-thermodynamics-of-evolution}

<!--list-separator-->

-  17.1 The notion of competition

<!--list-separator-->

-  17.2 Prebiotic evolution: general presentation

<!--list-separator-->

-  17.3 Prebiotic polymer formation

<!--list-separator-->

-  17.4 Biopolymer competition and hypercycles

<!--list-separator-->

-  17.5 Evolution viewed as a problem of stability

<!--list-separator-->

-  17.6 Evolutionary feedback

<!--list-separator-->

-  17.7 Energy dissipation in simple reaction networks

<!--list-separator-->

-  17.8 A biochemical illustration


### 18. Thermodynamics of ecosystems {#18-dot-thermodynamics-of-ecosystems}

<!--list-separator-->

-  18.1 Introduction

<!--list-separator-->

-  18.2 basic equations

<!--list-separator-->

-  18.3 Example of ordered behavior: organization in insect societies

<!--list-separator-->

-  18.4 Evolution in ecosystems

<!--list-separator-->

-  18.5 Structural instabilities and increase of complexity

<!--list-separator-->

-  18.6 Stability and complexity
